app/views/surveys/show.html.erb

  <div class="survey_info">
	<div class="page_status">Page: 1/1 Question No:<%= @survey.questions.size %></div>
---
SELECT "questions".* FROM "questions" WHERE "questions"."survey_id" = 6
SELECT COUNT(*) FROM "questions" WHERE "questions"."survey_id" = 6