app/views/surveys/stats.html.erb

SELECT "questions".* FROM "questions" WHERE "questions"."survey_id" = 5
SELECT COUNT(*) FROM "questions" WHERE "questions"."survey_id" = 6
---
  <div class="survey_info">
	<div class="page_status">Page: 1/1 Question No:<%= @survey.questions.size %></div>