app/views/roles/users.html.erb

SELECT "roles".* FROM "roles" INNER JOIN "roles_users" ON "roles"."id" = "roles_users"."role_id" WHERE "roles_users"."user_id" = 8
---
			<td>
				<%user.roles.each do|role|%>