app/controllers/roles_controller.rb

  def add
    @role = Role.new(params[:role])
    if @role.save
---
INSERT INTO "roles" ("created_at", "group", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Thu, 23 Feb 2012 01:58:36 UTC +00:00], ["group", "expedia"], ["name", "Expdel4"], ["updated_at", Thu, 23 Feb 2012 01:58:36 UTC +00:00]]

  def show
      role = Role.find(params[:id])
---
SELECT "roles".* FROM "roles" WHERE "roles"."id" = $1 LIMIT 1  [["id", "5"]]

  def update
    role = Role.find(params[:id])
    role2 = params[:role]
    if(role.name == role2[:name] && role.group == role2[:group])
      render :json => '{"status": "nochanged"}'
    else
      if role.update_attributes(params[:role])
---
SELECT "roles".* FROM "roles" WHERE "roles"."id" = $1 LIMIT 1  [["id", "2"]]
UPDATE "roles" SET "name" = 'Owner', "updated_at" = '2012-02-27 09:40:18.357380' WHERE "roles"."id" = 2

  def users
    search_string = params[:search_string] || ''
    @users = User.where("email like ?", "%#{search_string}%").paginate(:page => params[:page], :per_page => 10)
    @roles = Role.all
---
SELECT "users".* FROM "users" WHERE (email like '%%') ORDER BY email ASC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "users" WHERE (email like '%%')
SELECT "roles".* FROM "roles"

  def grant
    user_ids = (params[:users] || {}).reduce([]){|arr, user| arr << user[0] }
    users = User.find(user_ids)
    role = Role.find(params[:role])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "roles".* FROM "roles" WHERE "roles"."id" = $1 LIMIT 1  [["id", "8"]]

  def ungrant
    user_ids = (params[:users] || {}).reduce([]){|arr, user| arr << user[0] }
    users = User.find(user_ids)
    role = Role.find(params[:role])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "roles".* FROM "roles" WHERE "roles"."id" = $1 LIMIT 1  [["id", "8"]]