app/controllers/surveys_controller.rb

SELECT COUNT(*) FROM "roles" INNER JOIN "roles_users" ON "roles"."id" = "roles_users"."role_id" WHERE "roles_users"."user_id" = 5
---
  def index
    where_clause = "(lock = false)"
    if params[:keywords]
      where_clause += " and (name like '%#{params[:keywords]}%')"
    end
    if current_user.role? :admin
      #@surveys = Survey.all
      @surveys = Survey.where(where_clause).paginate(:page => params[:page], :per_page => 12).order('updated_at DESC')
    else
      roles = current_user.roles.reduce(['Public']){|a, role| a << role.name}
      where_clause += ' and ("surveys"."group" in (?) or user_id = ?)'
      @surveys = Survey.where(where_clause, roles, current_user.id).paginate(:page => params[:page], :per_page => 12).order('updated_at DESC')

SELECT "surveys".* FROM "surveys" WHERE "surveys"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def new
    @survey = Survey.new
    is_new = true
    if params[:id]
      begin
        clone_survey Survey.find(params[:id]), @survey

SELECT "questions".* FROM "questions" WHERE "questions"."survey_id" IS NULL AND "questions"."id" IN (1, 2, 3)
INSERT INTO "questions" ("created_at", "question_type", "survey_id", "title", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Thu, 23 Feb 2012 01:58:11 UTC +00:00], ["question_type", 0], ["survey_id", 6], ["title", "Aaaaaa"], ["updated_at", Thu, 23 Feb 2012 01:58:11 UTC +00:00]]
SELECT "roles".* FROM "roles" WHERE "roles"."group" = 'public'
---
  def create
#    @survey = Survey.new(params[:survey])
    status = true
    questions = @survey.questions
    questions.each do |q|
      if q.choices == []
        status = false
      end
    end
    respond_to do |format|
      if status
        if @survey.save
          if @survey.group != 'Public'
            @users = Role.find_by_name(@survey.group).users
            @users.each do |user|

SELECT "questions".* FROM "questions" WHERE "questions"."survey_id" = 6 AND "questions"."id" IN (10)
---
  def update
#    @survey = Survey.find(params[:id])
    status = true
    @survey.update_attributes(params[:survey])
    questions = @survey.questions
    questions.each do |q|

SELECT "users".* FROM "users"
SELECT "roles".* FROM "roles" WHERE (name = 'Public') LIMIT 1
SELECT "users".* FROM "users" INNER JOIN "roles_users" ON "users"."id" = "roles_users"."user_id" WHERE "roles_users"."role_id" = 5
SELECT DISTINCT COUNT("records"."user_id") FROM "records" WHERE (survey_id = 1)
SELECT DISTINCT COUNT("records"."user_id") FROM "records"
---
  def stats
    @survey = Survey.find(params[:id]);
    authorize! :read, @survey, :message => "Unable to read this article."
    @stats = Statistics.where("survey_id = ?", params[:id]).first
    result_by_choices, result_by_users = @stats ? stats_of_percentage(@stats, @survey) : [Hash.new(0), Hash.new(0)]
    if @survey.group == 'Public'
      @user_count = User.all.size
    else
      @user_count = Role.where('name = ?', @survey.group).first.users.size
    end
    users = Record.where("survey_id = ?", @survey.id).select(:user_id).uniq
    puts users #BUG BUG BUG, here make sure the sql is laoded.
    @take_user_count = users.size