app/controllers/surveys_controller.rb

SELECT "surveys".* FROM "surveys" WHERE (surveys.group in ('Public','Creator') or user_id = 8)
SELECT "roles".* FROM "roles" INNER JOIN "roles_users" ON "roles"."id" = "roles_users"."role_id" WHERE "roles_users"."user_id" IS NULL AND "roles"."name" = 'SuperAdmin' LIMIT 1
SELECT "surveys".* FROM "surveys" WHERE ("surveys"."group" in ('Public','SuperAdmin') or user_id = 4)
---
  def index
    if current_user.role? :admin
      @surveys = Survey.all
    else
      roles = current_user.roles.reduce(['Public']){|a, role| a << role.name}
      @surveys = Survey.where("surveys.group in (?) or user_id = ?", roles, current_user.id)

INSERT INTO "surveys" ("created_at", "desc", "group", "name", "status", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
#    @survey = Survey.new(params[:survey])
    respond_to do |format|
      if @survey.save

UPDATE "surveys" SET "name" = 'Group Expedia DEL4', "group" = 'Expdel4', "updated_at" = '2012-02-27 07:43:25.391423' WHERE "surveys"."id" = 7
---
  def update
#    @survey = Survey.find(params[:id])
    respond_to do |format|
      if @survey.update_attributes(params[:survey])

DELETE FROM "surveys" WHERE "surveys"."id" = ?  [["id", 8]]
---
  def destroy
#    @survey = Survey.find(params[:id])
    @survey.destroy

SELECT "statistics".* FROM "statistics" WHERE (survey_id = '5') LIMIT 1
SELECT "surveys".* FROM "surveys" WHERE "surveys"."id" = $1 LIMIT 1  [["id", "5"]]
---
  def stats
    @stats = Statistics.where("survey_id = ?", params[:id]).first
    @survey = Survey.find(params[:id]);

SELECT "surveys".* FROM "surveys" WHERE "surveys"."id" = $1 LIMIT 1  [["id", "5"]]
---
  def take
    status = allow_user_take_survey && take_survey
    respond_to do |format|
      if status
        format.html { redirect_to action: 'stats', notice: 'Thank you for your participation.' }
        format.json { render json: @stats, status: :created, location: @survey }
      else
        error = @stats ? @stats.errors : "You have already taken this survey."
        @survey = Survey.find(params[:id])

SELECT "surveys".* FROM "surveys" WHERE "surveys"."id" = $1 LIMIT 1  [["id", "6"]]
---
  def show
    @survey = Survey.find(params[:id])