app/controllers/surveys_controller.rb

  def index
    if current_user.role? :admin
      #@surveys = Survey.all
      @surveys = Survey.paginate(:page => params[:page], :per_page => 8).order('created_at ASC')
    else
      roles = current_user.roles.reduce(['Public']){|a, role| a << role.name}
      @surveys = Survey.where('"surveys"."group" in (?) or user_id = ?', roles, current_user.id).paginate(:page => params[:page], :per_page => 8).order('created_at ASC')
---
SELECT "surveys".* FROM "surveys" ORDER BY created_at ASC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "surveys"
SELECT "surveys".* FROM "surveys" WHERE ("surveys"."group" in ('Public','Vanceinfo','Owner') or user_id = 3) ORDER BY created_at ASC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "surveys" WHERE ("surveys"."group" in ('Public','Vanceinfo','Owner') or user_id = 3)